# Exercícios Módulo IV - Banco de Dados - Curso Ciência de Dados do Zero:

In [1]:
# importanto o sqlite3

import sqlite3

In [2]:
# Criando/conectando ao banco de dados:

conn = sqlite3.connect("modulo4.db") 
cursor = conn.cursor()

**1. A) Criar uma tabela chamada dados_cadastrais onde cada linha representa um funcionário contendo os seguintes atributos: Id, nome, sobrenome, data_nasci, cpf e endereco.**


**1. B) criar uma tabela chamada dados_profissionais contendo os seguintes atributos: id, graduacao, cargo, salario e tempo_casa.**


**Insira 4 registros em cada uma das tabelas!**


Obs.: Como a data de nascimento não foi informada nos dados do exercício, você pode inserir uma data fictícia a sua escolha ou ainda atribuir o valor 0.

In [3]:
# Criar tabela 1:

cursor.execute("CREATE TABLE dados_cadastrais (Id integer, nome text, sobrenome text, data_nasci integer, cpf inteiro, endereco text)");


# Criar tabela 2:
cursor.execute("CREATE TABLE dados_profissionais (Id integer, graduacao text, cargo text, salario float, tempo_casa inteiro)");
print('Tabelas criadas com sucesso!')

Tabelas criadas com sucesso!

In [4]:
#Verificando a criação das tabelas. 

cursor.execute('SELECT name from sqlite_master where type= "table"')

#O comando fetchall é responsável por apresentar o resultado da query.
cursor.fetchall()

[('dados_cadastrais',), ('dados_profissionais',)]

#se necessário, para reiniciar o exercício, realizar a exclusão das tabelas.
cursor.execute("DROP TABLE dados_cadastrais")
cursor.execute("DROP TABLE dados_profissionais")
print('As tabelas foram excluída com sucesso!')

In [5]:
# Inserir dados na tabela 1:

cursor.execute("INSERT INTO dados_cadastrais VALUES(1, 'maria', 'silva', 0, 11111211313, 'rua 1 - SP')") 
cursor.execute("INSERT INTO dados_cadastrais VALUES(2, 'joao', 'silva', 0, 11111311315, 'rua 2 - SP')") 
cursor.execute("INSERT INTO dados_cadastrais VALUES(1, 'pedro', 'pereira', 0, 11111411316, 'rua 8 - SP')") 
cursor.execute("INSERT INTO dados_cadastrais VALUES(1, 'paulo', 'ribeiro', 0, 11123211301, 'rua 9 - SP')") 
conn.commit()

In [6]:
# Visualizando a tabela 1:

cursor.execute("SELECT * FROM dados_cadastrais")
cursor.fetchall()

[(1, 'maria', 'silva', 0, 11111211313, 'rua 1 - SP'),
 (2, 'joao', 'silva', 0, 11111311315, 'rua 2 - SP'),
 (1, 'pedro', 'pereira', 0, 11111411316, 'rua 8 - SP'),
 (1, 'paulo', 'ribeiro', 0, 11123211301, 'rua 9 - SP')]

In [7]:
# Inserir dados na tabela 2:

cursor.execute("INSERT INTO dados_profissionais VALUES(1, 'matematica', 'professor', 3500.89, 3)") 
cursor.execute("INSERT INTO dados_profissionais VALUES(2, 'geografia', 'orientador', 2850.8, 1)")
cursor.execute("INSERT INTO dados_profissionais VALUES(3, 'historia', 'orientador', 3200.45, 1)")
cursor.execute("INSERT INTO dados_profissionais VALUES(4, 'fisica', 'professor', 1890.33, 2)")
conn.commit()

In [8]:
# Visualizando a tabela 2:

cursor.execute("SELECT * FROM dados_profissionais")
cursor.fetchall()

[(1, 'matematica', 'professor', 3500.89, 3),
 (2, 'geografia', 'orientador', 2850.8, 1),
 (3, 'historia', 'orientador', 3200.45, 1),
 (4, 'fisica', 'professor', 1890.33, 2)]

**2. Usando a tabela dados_profissionais, escreva uma query que retorne todos os campos da tabela ordenando-os pela coluna tempo_casa de maneira decrescente.**

In [9]:
cursor.execute("SELECT * FROM dados_profissionais ORDER BY tempo_casa DESC")
cursor.fetchall()

[(1, 'matematica', 'professor', 3500.89, 3),
 (4, 'fisica', 'professor', 1890.33, 2),
 (2, 'geografia', 'orientador', 2850.8, 1),
 (3, 'historia', 'orientador', 3200.45, 1)]

**3. Conte a quantidade de funcionarios dessa empresa**

In [10]:
cursor.execute("SELECT COUNT(Id) FROM dados_cadastrais")
cursor.fetchall()

[(4,)]

**4. Usando a tabela dados_cadastrais, escreva uma query que liste apenas os funcionarios que possuem sobrenome "silva" ordenados pelo nome completo, ou seja, nome e sobrenome.**

In [11]:
cursor.execute("SELECT * FROM dados_cadastrais WHERE sobrenome=='silva' ORDER BY nome")
cursor.fetchall()

[(2, 'joao', 'silva', 0, 11111311315, 'rua 2 - SP'),
 (1, 'maria', 'silva', 0, 11111211313, 'rua 1 - SP')]

**5. Escreva uma query que liste o valor da folha de pagamento dessa empresa por cargo usando a tabela dados_profissionais, ou seja, somar os salarios em cada cargo.**

In [12]:
cursor.execute("SELECT SUM(salario), cargo FROM dados_profissionais GROUP BY cargo ")
cursor.fetchall()

[(6051.25, 'orientador'), (5391.219999999999, 'professor')]